# BarDiameter Property (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
RebarBendData..::..BarDiameter Property
RebarBendData Class See Also
---
Defines bar model diameter of rebar
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2012
# Syntax
C#
---
```text
[ObsoleteAttribute("This property is deprecated in Revit 2022 and may be removed in a later version of Revit. It returns the BarModelDiameter. We suggest you replace it with BarModelDiameter or BarNominalDiameter property instead, depending on your needs.")]
public double BarDiameter { get; set; }
```

Visual Basic
---
```text
<ObsoleteAttribute("This property is deprecated in Revit 2022 and may be removed in a later version of Revit. It returns the BarModelDiameter. We suggest you replace it with BarModelDiameter or BarNominalDiameter property instead, depending on your needs.")> _
Public Property BarDiameter As Double
	Get
	Set
```

Visual C++
---
```text
[ObsoleteAttribute(L"This property is deprecated in Revit 2022 and may be removed in a later version of Revit. It returns the BarModelDiameter. We suggest you replace it with BarModelDiameter or BarNominalDiameter property instead, depending on your needs.")]
public:
property double BarDiameter {
	double get ();
	void set (double value);
}
```

# ### Field Value
The bar model diameter of rebar
# See Also
RebarBendData Class
Autodesk.Revit.DB.Structure Namespace